In [1]:
Date='02/01/2020'

In [2]:
type(Date)

str

In [3]:
import pandas as pd

In [4]:
date = pd.to_datetime(Date)

In [7]:
type(date)

pandas._libs.tslibs.timestamps.Timestamp

In [8]:
date.year

2020

In [9]:
import datetime

In [10]:
x = datetime.datetime.now()

In [11]:
print(x)

2020-01-07 10:25:54.590152

In [12]:
x.year

2020

In [16]:
print(x.strftime('%A'))  #like operator

Tuesday

In [18]:
y = datetime.datetime(1990,2,23)

In [20]:
y.year

1990

In [22]:
y.day

23

In [23]:
y.month

2

In [26]:
print(y.strftime('%A'))

Friday

In [29]:
print(y.strftime('%B'))

February

In [30]:
print(y.strftime('%F'))

1990-02-23

In [31]:
print(y)

1990-02-23 00:00:00

#### Combine First Function.

In [33]:
import numpy as np
ser = pd.Series([1.0,2.0,np.nan,4.0])

In [34]:
ser1 = pd.Series([2,5,6,10])

In [35]:
ser

0    1.0
1    2.0
2    NaN
3    4.0
dtype: float64

In [36]:
ser1

0     2
1     5
2     6
3    10
dtype: int64

In [38]:
ser.combine_first(ser1)  #combine first replace with nan

0    1.0
1    2.0
2    6.0
3    4.0
dtype: float64

In [43]:
dataframe = pd.DataFrame({0:[1.0,np.nan,np.nan],1:[2.0,5.0,np.nan],2:[np.nan,6.0,9.0]})

In [44]:
dataframe

     0    1    2
0  1.0  2.0  NaN
1  NaN  5.0  6.0
2  NaN  NaN  9.0

In [45]:
df2 = pd.DataFrame({0:[2.0,np.nan,1.0],3:[2.0,4.0,5.0],6:[3.0,6.0,9.0]})

In [46]:
df2

     0    3    6
0  2.0  2.0  3.0
1  NaN  4.0  6.0
2  1.0  5.0  9.0

In [48]:
dataframe.combine_first(df2)  #fill the null

     0    1    2    3    6
0  1.0  2.0  NaN  2.0  3.0
1  NaN  5.0  6.0  4.0  6.0
2  1.0  NaN  9.0  5.0  9.0

#### IDX max

In [53]:
Dataframe = pd.DataFrame(np.random.randint(1,50,size=[3,3]),columns=list('ABC'))

In [54]:
Dataframe

    A   B   C
0  37  34   1
1   6  24  21
2  27  36  10

In [56]:
dataframe = pd.DataFrame({'A':[35,37,42,38],'B':[41,45,49,44],'C':[12,31,33,39]})

In [57]:
dataframe

    A   B   C
0  35  41  12
1  37  45  31
2  42  49  33
3  38  44  39

In the first columns 42 higher in row 2 that is return first.

In [58]:
dataframe.idxmax(axis=0)

A    2
B    2
C    3
dtype: int64

Idxmax function returns index of first occurace of maximum over requested while finding the index of the maximum values accross any index all null values excluded.

#### Import Files.

 #### CSV File

pd.read_csv(address.csv)

#### Exel Files.

pd.read_excel(address.xlsx)